app/controllers/flocks_controller.rb

  def index
    @flocks = Flock.all
---
SELECT "flocks".* FROM "flocks"

  def show
    @flock = Flock.find(params[:id])
---
SELECT "flocks".* FROM "flocks" WHERE "flocks"."id" = ? LIMIT 1  [["id", "index"]]

  def create
    @flock = Flock.new(params[:flock])

    respond_to do |format|
      if @flock.save
---
INSERT INTO "flocks" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 11 Jul 2013 02:05:02 UTC +00:00], ["updated_at", Thu, 11 Jul 2013 02:05:02 UTC +00:00]]